[
  {
    "timestamp": "2025-08-12T22:36:58.200135",
    "text": "By Billy Begas\n\nCavite Rep. Lani Mercado-Revilla has refiled her Unang Yakap bill, which seeks to reduce the number of newborn deaths in the country. Mercado-Revilla said House Bill 2335 aimed to institutionalize the Department of Health’s (DOH) Essential Intrapartum and Newborn Care (EINC) protocol in all health facilities nationwide. “It is essential to underscore that newborns need to be with their mothers to start breastfeeding within the first hour of life. Having the babies and their mothers placed in immediate skin-to-skin contact helps the babies adjust to life outside the womb,” Mercado-Revilla said in the explanatory note of the bill.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.56,
    "user_comment": "",
    "link": "https://politiko.com.ph/2025/08/12/act-of-love-lani-mercado-revives-unang-yakap-bill-to-curb-infant-mortality-support-mothers/headlines/",
    "title": "‘Act of love’: Lani Mercado revives ‘Unang Yakap’ bill to curb infant mortality, support mothers",
    "summary": "Cavite Rep. Lani Mercado-Revilla refiled her Unang Yakap bill (House Bill 2335) to reduce newborn deaths in the country. The bill aims to institutionalize the Department of Health’s (DOH) Essential Intrapartum and Newborn Care (EINC) protocol in all health facilities.",
    "factuality_score": 67,
    "processed_text": "billi bega cavit rep lani mercadorevilla refil unang yakap bill seek reduc number newborn death countri mercadorevilla said hous bill aim institution depart health doh essenti intrapartum newborn care einc protocol health facil nationwid essenti underscor newborn need mother start breastfeed within first hour life babi mother place immedi skintoskin contact help babi adjust life outsid womb mercadorevilla said explanatori note bill",
    "used_for_training": true,
    "training_date": "2025-08-12T23:56:57.929165"
  },
  {
    "timestamp": "2025-08-12T22:53:35.294532",
    "text": "SAN ANTONIO, Zambales, Philippines — Philippine vessels were again harassed by China during another mission on Monday to Panatag (Scarborough) Shoal in the West Philippine Sea (WPS). Philippine Coast Guard (PCG) vessels BRP Teresa Magbanua and BRP Suluan, together with government-owned fish carrier MV Pamamalakaya, encountered “hazardous” maneuvers and blocking actions by the China Coast Guard (CCG) and the People’s Liberation Army-Navy (PLAN) about 19.4 kilometers (10.5 nautical miles) east of Panatag Shoal, also called Bajo de Masinloc. “In particular, the MRRV 2206 (BRP Suluan) was targeted with a water cannon, but the seamanship skills of PCG crew members allowed the vessel to successfully evade getting hit,” said Commodore Jay Tarriela, PCG spokesperson for the West Philippine Sea.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.7999999999999999,
    "user_comment": "Many sources support the article.",
    "link": "https://www.inquirer.net/452404/chinese-ships-collide-while-pursuing-ph-vessel/",
    "title": "Chinese ships collide while pursuing PH vessel",
    "summary": "Philippine vessels faced harassment from the China Coast Guard and People’s Liberation Army-Navy during a mission near Panatag (Scarborough) Shoal in the West Philippine Sea. Chinese forces performed hazardous maneuvers and blocking actions against the Philippine Coast Guard ships and a government-owned fish carrier. The BRP Suluan was targeted with a water cannon but successfully evaded getting hit.",
    "factuality_score": 90,
    "processed_text": "san antonio zambal philippin philippin vessel harass china anoth mission monday panatag scarborough shoal west philippin sea wp philippin coast guard pcg vessel brp teresa magbanua brp suluan togeth governmentown fish carrier mv pamamalakaya encount hazard maneuv block action china coast guard ccg peopl liber armynavi plan kilomet nautic mile east panatag shoal also call bajo de masinloc particular mrrv brp suluan target water cannon seamanship skill pcg crew member allow vessel success evad get hit said commodor jay tarriela pcg spokesperson west philippin sea",
    "used_for_training": true,
    "training_date": "2025-08-12T23:56:57.929175"
  },
  {
    "timestamp": "2025-08-12T23:32:24.819148",
    "text": "MANILA – The Marcos administration’s intensified agricultural support and increased areas harvested for palay (unhusked rice) have helped fuel the Philippines’ historic-high yield for the first half of the year, the Department of Agriculture (DA) said. Based on the Philippine Statistics Authority's (PSA) latest data, the country hit over 9.077 million metric tons (MT) of palay production from January to June, higher than the previous all-time high of 9.026 MT for the same period in 2023, and last year’s 8.53 million MT. Agriculture spokesperson Assistant Secretary Arnel de Mesa said the government's intervention, which is primarily focused on achieving food security and affordability in line with the directive of President Ferdinand R. Marcos Jr., is now starting to yield results.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.51,
    "user_comment": "",
    "link": "https://www.pna.gov.ph/articles/1255524",
    "title": "PBBM’s support, high harvest area fuel 'historic' palay yield in H1",
    "summary": "The Philippines achieved a historic-high palay yield of over 9. 077 million metric tons for the first half of the year. This production, confirmed by the Philippine Statistics Authority, surpasses previous records for the same period.",
    "factuality_score": 88,
    "processed_text": "manila marco administr intensifi agricultur support increas area harvest palay unhusk rice help fuel philippin historichigh yield first half year depart agricultur da said base philippin statist author psa latest data countri hit million metric ton mt palay product januari june higher previou alltim high mt period last year million mt agricultur spokesperson assist secretari arnel de mesa said govern intervent primarili focus achiev food secur afford line direct presid ferdinand r marco jr start yield result",
    "used_for_training": true,
    "training_date": "2025-08-12T23:56:57.929177"
  },
  {
    "timestamp": "2025-08-13T00:14:58.431586",
    "text": "MANILA, Philippines — Justice Secretary Jesus Crispin Remulla is not throwing in the towel despite an online report claiming the Judicial and Bar Council (JBC) disqualified him for the ombudsman post due to a pending complaint in connection with the arrest of former president Rodrigo Duterte.\n“I’m not giving up on my application,” Remulla said in a short reply to reporters via Viber on Friday night.\n“I trust they (JBC members) will do what is right, considering the ombudsman case is ripe for dismissal given the pending case at the Supreme Court on the same matter,” Remulla added in another message sent via Viber yesterday.\nRemulla was referring to the pending petitions before the SC questioning the validity of the arrest of Duterte and his turnover to the International Criminal Court (ICC) in The Hague.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.61,
    "user_comment": "",
    "link": null,
    "title": "Remulla ‘not giving up’ on ombudsman bid",
    "summary": "Justice Secretary Jesus Crispin Remulla denies reports of his disqualification for the ombudsman post and remains committed to his application. An online report claimed the Judicial and Bar Council disqualified him due to a pending complaint concerning former President Rodrigo Duterte's arrest. Remulla trusts the JBC will act justly, citing a pending Supreme Court case on the same matter that he believes should lead to the complaint's dismissal.",
    "factuality_score": 77,
    "processed_text": "manila philippin justic secretari jesu crispin remulla throw towel despit onlin report claim judici bar council jbc disqualifi ombudsman post due pend complaint connect arrest former presid rodrigo dutert im give applic remulla said short repli report via viber friday night trust jbc member right consid ombudsman case ripe dismiss given pend case suprem court matter remulla ad anoth messag sent via viber yesterday remulla refer pend petit sc question valid arrest dutert turnov intern crimin court icc hagu"
  },
  {
    "timestamp": "2025-08-14T00:37:04.859073",
    "text": "MANILA, Philippines (Updated May 22, 2025; 4:13 p.m.) — Dozens of Cabinet members have expressed willingness to step down following President Ferdinand Marcos Jr.'s directive for all secretaries to submit courtesy resignations as part of a surprise reset of his administration. RELATED: After midterm setback, Marcos asks entire Cabinet to resign\n\nThe move comes after the administration suffered disappointing midterm election results, where less than half of the president's endorsed Senate candidates won seats. After receiving a Cabinet member's courtesy resignation, the president can choose whether to accept or decline it.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.84,
    "user_comment": "",
    "link": "https://www.philstar.com/headlines/2025/05/22/2445013/list-marcos-cabinet-members-submit-courtesy-resignations",
    "title": "LIST: Marcos Cabinet members to submit courtesy resignations",
    "summary": "President Ferdinand Marcos Jr. has directed all Cabinet secretaries to submit courtesy resignations as part of a surprise administration reset. This directive follows disappointing midterm election results, where less than half of his endorsed Senate candidates won.",
    "factuality_score": 66,
    "processed_text": "manila philippin updat may pm dozen cabinet member express willing step follow presid ferdinand marco jr direct secretari submit courtesi resign part surpris reset administr relat midterm setback marco ask entir cabinet resign move come administr suffer disappoint midterm elect result less half presid endors senat candid seat receiv cabinet member courtesi resign presid choos whether accept declin"
  },
  {
    "timestamp": "2025-08-14T03:46:48.266918",
    "text": "MANILA, Philippines — Sen. Loren Legarda issued a clear and urgent call to action following the Philippines’ participation in the Third United Nations Ocean Conference (UNOC3), urging for united efforts to protect the oceans and safeguard the livelihoods of Filipinos. Speaking at the DFA Ocean Talk, a post-UNOC3 symposium, on August 13, 2025, Legarda described the ocean as “the soul of our archipelago,” sustaining 2.24 million livelihoods and contributing Php 787 billion annually to the economy.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.59,
    "user_comment": "",
    "link": "https://newsinfo.inquirer.net/2095391/legarda-pushes-for-united-effort-to-protect-oceans-ph-livelihood",
    "title": "Legarda pushes for united effort to protect oceans, PH livelihood",
    "summary": "Senator Loren Legarda urged united efforts to protect oceans and safeguard Filipino livelihoods following the Third UN Ocean Conference. Speaking at the DFA Ocean Talk, she described the ocean as \"the soul of our archipelago. \" She noted it sustains 2.",
    "factuality_score": 64,
    "processed_text": "manila philippin sen loren legarda issu clear urgent call action follow philippin particip third unit nation ocean confer unoc urg unit effort protect ocean safeguard livelihood filipino speak dfa ocean talk postunoc symposium august legarda describ ocean soul archipelago sustain million livelihood contribut php billion annual economi"
  },
  {
    "timestamp": "2025-08-14T15:33:59.863388",
    "text": "MANILA – President Ferdinand R. Marcos Jr. bears an in-depth understanding of the pressing challenges besetting the education sector, Education Secretary Sonny Angara stressed on Wednesday. This came after the President said education remains the administration’s “top priority,” as he paid tribute to teachers, whom he described as the “heart of the education system” during his fourth State of the Nation Address (SONA). “I’ve never heard a SONA that dwelt so much on education that gave so many details, that shows the depth of understanding of our President on the problems,” Angara said during the post-SONA forum in San Juan City.",
    "predicted_label": "Fake",
    "actual_label": "Fake",
    "confidence": 0.75,
    "user_comment": "",
    "link": "https://www.pna.gov.ph/articles/1255517",
    "title": "PBBM gives prime, in-depth focus on education - DepEd chief",
    "summary": "Education Secretary Sonny Angara stated President Ferdinand R. Marcos Jr. has a deep understanding of the education sector's challenges.",
    "factuality_score": 28,
    "processed_text": "manila presid ferdinand r marco jr bear indepth understand press challeng beset educ sector educ secretari sonni angara stress wednesday came presid said educ remain administr top prioriti paid tribut teacher describ heart educ system fourth state nation address sona ive never heard sona dwelt much educ gave mani detail show depth understand presid problem angara said postsona forum san juan citi"
  },
  {
    "timestamp": "2025-08-14T15:47:15.189502",
    "text": "MANILA, Philippines — President Ferdinand Marcos Jr. on Thursday signed into law a measure aimed at strengthening the fiscal autonomy of the judicial branch of government.\n\nKnown as the Judiciary Fiscal Autonomy Act, the law allows the Supreme Court (SC) to submit its original budget proposal directly to Congress as an attachment to the National Expenditure Program prepared by the Department of Budget and Management (DBM).",
    "predicted_label": "Mixed",
    "actual_label": "Mixed",
    "confidence": 0.54,
    "user_comment": "",
    "link": null,
    "title": "Marcos signs law boosting judiciary’s fiscal autonomy",
    "summary": "President Ferdinand Marcos Jr. signed the Judiciary Fiscal Autonomy Act into law. This measure aims to strengthen the fiscal autonomy of the judicial branch of government.",
    "factuality_score": 50,
    "processed_text": "manila philippin presid ferdinand marco jr thursday sign law measur aim strengthen fiscal autonomi judici branch govern known judiciari fiscal autonomi act law allow suprem court sc submit origin budget propos directli congress attach nation expenditur program prepar depart budget manag dbm"
  },
  {
    "timestamp": "2025-08-14T16:04:14.326934",
    "text": "SEN. Bong Go and his Malasakit Team extended immediate assistance to families affected by Tropical Storms Crising and Dante, as well as Typhoon Emong, during a relief operation in Pasig City on July 24. Go expressed deep concern for those still struggling to recover, emphasizing that no Filipino should ever feel alone during such difficult times. Moved by the hardship and uncertainty faced by the affected communities, Go’s Malasakit Team reached out to 1,000 families from Barangay Santolan, Manggahan, Rosario, Dela Paz, Santa Lucia, Maybunga and Pinagbuhatan. Zubiri: Online gambling revenues jumped over 5,500% from 2020 to 2024\n\nGrocery packs, shirts, caps, fans, volleyballs and basketballs were distributed during the activity held at the respective evacuation centers of the barangay.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.6,
    "user_comment": "",
    "link": "https://www.manilatimes.net/2025/07/27/news/national/go-delivers-relief-aid-to-pasig-flood-victims/2156709",
    "title": "Go delivers relief aid to Pasig flood victims",
    "summary": "Senator Bong Go and his Malasakit Team conducted a relief operation in Pasig City on July 24. They provided immediate assistance and various goods to 1,000 families affected by Tropical Storms Crising and Dante, and Typhoon Emong. Go expressed deep concern, emphasizing that no Filipino should feel alone during such difficult times.",
    "factuality_score": 56,
    "processed_text": "sen bong go malasakit team extend immedi assist famili affect tropic storm crise dant well typhoon emong relief oper pasig citi juli go express deep concern still struggl recov emphas filipino ever feel alon difficult time move hardship uncertainti face affect commun go malasakit team reach famili barangay santolan manggahan rosario dela paz santa lucia maybunga pinagbuhatan zubiri onlin gambl revenu jump groceri pack shirt cap fan volleybal basketbal distribut activ held respect evacu center barangay"
  },
  {
    "timestamp": "2025-08-14T16:12:04.710768",
    "text": "MANILA, Philippines — Taking off from his father’s cue, House Majority Leader Ferdinand Alexander “Sandro” Marcos has promised to block the passage of a budget that would be heavily mutated or too far off from the National Expenditures Program (NEP). Marcos, during an ambush interview on Wednesday, said he will do what he can as majority leader to stop the passage of a budget bill that will deviate largely from the NEP — which is in keeping with the statements made by his father, President Ferdinand Marcos Jr., during the latter’s fourth State of the Nation Address (Sona).",
    "predicted_label": "Fake",
    "actual_label": "Fake",
    "confidence": 0.71,
    "user_comment": "",
    "link": "https://newsinfo.inquirer.net/2095333/rep-marcos-to-block-mutated-budget-too-far-off-from-nep-i-wont-allow-it",
    "title": "Rep. Marcos to block mutated budget too far off from NEP: ‘I won’t allow it’",
    "summary": "House Majority Leader Ferdinand Alexander “Sandro” Marcos pledged to block the passage of any budget bill that significantly deviates from the National Expenditures Program (NEP). This commitment aligns with the earlier stance expressed by his father, President Ferdinand Marcos Jr.",
    "factuality_score": 49,
    "processed_text": "manila philippin take father cue hous major leader ferdinand alexand sandro marco promis block passag budget would heavili mutat far nation expenditur program nep marco ambush interview wednesday said major leader stop passag budget bill deviat larg nep keep statement made father presid ferdinand marco jr latter fourth state nation address sona"
  },
  {
    "timestamp": "2025-08-14T16:29:39.182615",
    "text": "MANILA, Philippines—Senate Minority Leader Vicente “Tito” Sotto III believes there is no compelling reason yet to amend the 1987 Constitution unless it is amended by the Supreme Court (SC). “I’ll still wait for the result of the MR (motion for reconsideration) before I decide to support or not,” Sotto said in a text message on Wednesday. He was referring to the MR pending before the Supreme Court on its decision to declare the complaint against Vice President Sara Duterte unconstitutional for violating the one-year rule on filing cases of impeachment. “Right now, there is compelling reason unless the SC amends the Constitution. I know the meaning of forthwith though others do not,” Sotto added.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.66,
    "user_comment": "",
    "link": "https://newsinfo.inquirer.net/2095049/no-compelling-reason-yet-for-cha-cha",
    "title": "Sotto: No compelling reason yet for Cha-cha",
    "summary": "Senate Minority Leader Vicente Sotto III believes there is no compelling reason to amend the 1987 Constitution unless the Supreme Court effectively amends it. He is awaiting the Supreme Court's decision on a motion for reconsideration regarding its ruling on a complaint against Vice President Sara Duterte, which was declared unconstitutional for violating the one-year rule for filing impeachment cases.",
    "factuality_score": 74,
    "processed_text": "manila philippinessen minor leader vicent tito sotto iii believ compel reason yet amend constitut unless amend suprem court sc ill still wait result mr motion reconsider decid support sotto said text messag wednesday refer mr pend suprem court decis declar complaint vice presid sara dutert unconstitut violat oneyear rule file case impeach right compel reason unless sc amend constitut know mean forthwith though other sotto ad"
  },
  {
    "timestamp": "2025-08-14T16:33:19.308115",
    "text": "MANILA, Philippines — Department of Public Works and Highways (DPWH) Secretary Manuel Bonoan still enjoys the trust and confidence of President Ferdinand Marcos Jr., despite the issues hounding the almost 10,000 flood control projects implemented by the agency in the past three years of the administration. “His trust with Secretary Bonoan remains,” Palace press officer Claire Castro said in a briefing on Tuesday. As proof, President Marcos even joined Bonoan during the inspection of several projects in Marikina City on Monday, right after he told reporters about the initial findings of the Palace’s review of the DPWH’s flood mitigation projects.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.74,
    "user_comment": "",
    "link": "https://newsinfo.inquirer.net/2094989/marcos-still-trusts-dpwh-chief-bonoan-palace",
    "title": "Marcos still trusts DPWH chief Bonoan – Palace",
    "summary": "DPWH Secretary Manuel Bonoan retains President Ferdinand Marcos Jr. 's trust despite issues with 10,000 flood control projects. The Palace confirmed the President's continued confidence in Bonoan.",
    "factuality_score": 68,
    "processed_text": "manila philippin depart public work highway dpwh secretari manuel bonoan still enjoy trust confid presid ferdinand marco jr despit issu hound almost flood control project implement agenc past three year administr trust secretari bonoan remain palac press offic clair castro said brief tuesday proof presid marco even join bonoan inspect sever project marikina citi monday right told report initi find palac review dpwh flood mitig project"
  },
  {
    "timestamp": "2025-08-15T01:26:49.347188",
    "text": "MANILA - The Palace on Thursday said President Ferdinand Marcos Jr. has ordered several agencies to launch a thorough probe into the recent incidents of violence within school premises. Palace Press Officer Claire Castro said that the President has ordered the Department of Education (DepEd), the Department of the Interior and Local Government (DILG), and the Philippine National Police (PNP) to investigate the matter. The Department of Social Welfare and Development (DSWD) has also been tapped to help in evaluating and monitoring of the implementation of child protection policies in schools nationwide.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.63,
    "user_comment": "",
    "link": "https://www.abs-cbn.com/news/nation/2025/8/14/marcos-jr-orders-inter-agency-probe-on-school-based-violence-2047",
    "title": "Marcos Jr. orders inter-agency probe on school-based violence",
    "summary": "President Ferdinand Marcos Jr. ordered a thorough probe into recent school violence incidents, directing the Department of Education, DILG, and PNP to investigate. The Department of Social Welfare and Development will also assist by evaluating and monitoring child protection policies in schools nationwide.",
    "factuality_score": 55,
    "processed_text": "manila palac thursday said presid ferdinand marco jr order sever agenc launch thorough probe recent incid violenc within school premis palac press offic clair castro said presid order depart educ depe depart interior local govern dilg philippin nation polic pnp investig matter depart social welfar develop dswd also tap help evalu monitor implement child protect polici school nationwid"
  },
  {
    "timestamp": "2025-08-16T15:21:11.217155",
    "text": "MANILA, Philippines – National Bureau of Investigation (NBI) Director Jaime Santiago has resigned from his post, Justice Secretary Jesus Crispin “Boying” Remulla confirmed to Rappler on Saturday, August 16. The NBI is an attached agency of the Department of Justice (DOJ). In his resignation letter addressed to President Ferdinand Marcos Jr., Santiago cited “detractors” and “those who have sinister interests” in his position as among the reasons for his irrevocable resignation. “Those covert moves started when I tendered my courtesy resignation in respond to your call. To my mind, lies, if repeated overtime, will give a semblance of truth. I cannot allow this seemingly orchestrated move to blacken my reputation which I molded through the years,” Santiago said.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.55,
    "user_comment": "",
    "link": "https://www.rappler.com/philippines/nbi-director-jaime-santiago-resigns/",
    "title": "NBI chief Jaime Santiago resigns, cites ‘orchestrated move’ to taint his reputation",
    "summary": "National Bureau of Investigation (NBI) Director Jaime Santiago has resigned from his post. Justice Secretary Jesus Crispin Remulla confirmed Santiago's resignation on Saturday, August 16. Santiago cited \"detractors\" and an \"orchestrated move\" to blacken his reputation as reasons for his irrevocable decision.",
    "factuality_score": 56,
    "processed_text": "manila philippin nation bureau investig nbi director jaim santiago resign post justic secretari jesu crispin boy remulla confirm rappler saturday august nbi attach agenc depart justic doj resign letter address presid ferdinand marco jr santiago cite detractor sinist interest posit among reason irrevoc resign covert move start tender courtesi resign respond call mind lie repeat overtim give semblanc truth cannot allow seemingli orchestr move blacken reput mold year santiago said"
  },
  {
    "timestamp": "2025-08-16T16:40:43.795672",
    "text": "By REUTERS\n\nBEIJING, Aug 15 (Reuters) – China’s defence ministry accused Philippine Coast Guard vessels on Friday of “dangerous manoeuvres” in response to reports of a collision earlier this week between two Chinese vessels near Scarborough Shoal in the disputed South China Sea. The Philippine vessels’ actions “seriously endangered the safety of Chinese vessels and personnel,” ministry spokesperson Jiang Bin. Jiang neither confirmed nor denied that there had been a collision involving two Chinese vessels on Monday. “We demand that the Philippine side immediately stop its infringing and provocative rhetoric and actions,” Jiang said.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 1,
    "user_comment": "",
    "link": "https://politiko.com.ph/2025/08/15/china-accuses-philippine-vessels-of-dangerous-manoeuvres-after-its-own-ships-collided/daily-feed/",
    "title": "China accuses Philippine vessels of ‘dangerous manoeuvres’ after its own ships collided",
    "summary": "China's defense ministry accused Philippine Coast Guard vessels of \"dangerous manoeuvres\" near Scarborough Shoal in the disputed South China Sea. This accusation followed reports of a collision between two Chinese vessels earlier in the week, which China neither confirmed nor denied. China demanded that the Philippines immediately cease its \"infringing and provocative rhetoric and actions.",
    "factuality_score": 80,
    "processed_text": "reuter beij aug reuter china defenc ministri accus philippin coast guard vessel friday danger manoeuvr respons report collis earlier week two chines vessel near scarborough shoal disput south china sea philippin vessel action serious endang safeti chines vessel personnel ministri spokesperson jiang bin jiang neither confirm deni collis involv two chines vessel monday demand philippin side immedi stop infring provoc rhetor action jiang said"
  },
  {
    "timestamp": "2025-08-16T17:31:35.061478",
    "text": "In the wake of the mysterious marijuana-like scent detected in the Senate, health reform advocate Dr. Tony Leachon is pushing for certain accountability steps. Leachon has called for a full investigation by the Senate ethics panel as well as drug test for all Senate personnel. According to Leachon, any drug use allegation inside the Senate premises was “not merely a breach of decorum” but ” a direct affront to the Filipino people.”\n\n“The Senate must uphold its integrity by ensuring that all personnel—regardless of rank or affiliation—are held to the same standard of accountability,” he said in a Facebook post. “This is not about one individual. It is about the culture we tolerate in our institutions.",
    "predicted_label": "Mixed",
    "actual_label": "Real",
    "confidence": 0.54,
    "user_comment": "",
    "link": "https://politiko.com.ph/2025/08/15/weed-smell-at-senate-leachon-calls-for-ethics-probe-drug-test-for-all-personnel/headlines/",
    "title": "Weed smell at Senate? Leachon calls for ethics probe, drug test for all personnel",
    "summary": "Following a mysterious marijuana-like scent detected in the Senate, health reform advocate Dr. Tony Leachon is pushing for accountability measures. He has called for a full investigation by the Senate ethics panel and drug tests for all Senate personnel.",
    "factuality_score": 65,
    "processed_text": "wake mysteri marijuanalik scent detect senat health reform advoc dr toni leachon push certain account step leachon call full investig senat ethic panel well drug test senat personnel accord leachon drug use alleg insid senat premis mere breach decorum direct affront filipino peopl senat must uphold integr ensur personnelregardless rank affiliationar held standard account said facebook post one individu cultur toler institut"
  },
  {
    "timestamp": "2025-08-16T17:36:34.829320",
    "text": "Australia and the Philippines opened their largest-ever joint military exercise on Friday, a show of force that underscores deepening security ties as both countries grapple with Beijing’s growing assertiveness in the South China Sea. The exercise, dubbed Alon 25, will run through Aug. 29 and involve more than 3,600 troops from the Australian Defence Force (ADF), the Armed Forces of the Philippines (AFP), the U.S. Marine Corps and the Royal Canadian Navy. Training will take place across Palawan and Luzon — territories that sit on the front line of Manila’s confrontation with China over contested reefs and shipping lanes. Vice Adm. Justin Jones, chief of joint operations for the ADF, said the drills highlight “the strength of the Australian-Philippines security partnership” and reaffirm Canberra’s commitment to a rules-based order in the Indo-Pacific. The region, he said, must remain one “where state sovereignty is protected, international law is followed, and nations can make decisions free from coercion.” The war games will test joint operations across land, sea, air, cyber and space domains.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.71,
    "user_comment": "",
    "link": null,
    "title": "Australia, Philippines Launch Largest Joint Military Drills in Signal to China",
    "summary": "Australia and the Philippines commenced their largest-ever joint military exercise, Alon 25, with participation from U. S. and Canadian forces.",
    "factuality_score": 72,
    "processed_text": "australia philippin open largestev joint militari exercis friday show forc underscor deepen secur tie countri grappl beij grow assert south china sea exercis dub alon run aug involv troop australian defenc forc adf arm forc philippin afp us marin corp royal canadian navi train take place across palawan luzon territori sit front line manila confront china contest reef ship lane vice adm justin jone chief joint oper adf said drill highlight strength australianphilippin secur partnership reaffirm canberra commit rulesbas order indopacif region said must remain one state sovereignti protect intern law follow nation make decis free coercion war game test joint oper across land sea air cyber space domain"
  },
  {
    "timestamp": "2025-08-16T18:36:49.006999",
    "text": "AKAP, one of the government’s financial aid programs, seeks to help near-poor Filipinos burdened by inflation. Why does it remain controversial despite its ostensibly beneficent motives? Rappler reporter Dwight de Leon unpacks Speaker Martin Romualdez’s pet project in this explainer video.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 1,
    "user_comment": "",
    "link": "https://www.rappler.com/newsbreak/podcasts-videos/explainer-controversial-akap-speaker-martin-romualdez-cash-aid-program/",
    "title": "What’s wrong with AKAP, Speaker Romualdez’s pet project?",
    "summary": "AKAP is a government financial aid program aimed at assisting near-poor Filipinos affected by inflation. Despite its beneficent goals, the program remains controversial. Rappler reporter Dwight de Leon details this \"pet project\" of Speaker Martin Romualdez in an explainer video.",
    "factuality_score": 99,
    "processed_text": "akap one govern financi aid program seek help nearpoor filipino burden inflat remain controversi despit ostens benefic motiv rappler report dwight de leon unpack speaker martin romualdez pet project explain video"
  },
  {
    "timestamp": "2025-08-16T19:00:44.803028",
    "text": "MANILA, Philippines— Sen. Panfilo Lacson believes it would be best for the Senate to “exercise prudence” and wait for the Supreme Court (SC) to rule with finality on the impeachment case against Vice President Sara Duterte.\n\nLacson, though, stressed that his stand to respect and obey the ruling of the high tribunal on the impeachment trial of Duterte “has not changed and will not change for the same reason which I stated earlier.”\n\nHe earlier warned of chaos if the decision of the SC, as the final arbiter and interpreter of the Constitution, is not followed.\n\n“Regarding the impending Senate debate on this issue, it is best to exercise prudence and wait for the SC to rule with finality,” Lacson said in a Viber message to reporters.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.6699999999999999,
    "user_comment": "",
    "link": null,
    "title": "Lacson on Senate impeach debate: Best to wait for SC final ruling",
    "summary": "Senator Panfilo Lacson advises the Senate to wait for the Supreme Court's final ruling on the impeachment case against Vice President Sara Duterte. He emphasized his consistent stance to respect the high tribunal's decision, warning that not following it could lead to chaos. Lacson believes exercising prudence and awaiting the SC's final determination is the best approach.",
    "factuality_score": 74,
    "processed_text": "manila philippin sen panfilo lacson believ would best senat exercis prudenc wait suprem court sc rule final impeach case vice presid sara dutert lacson though stress stand respect obey rule high tribun impeach trial dutert chang chang reason state earlier earlier warn chao decis sc final arbit interpret constitut follow regard impend senat debat issu best exercis prudenc wait sc rule final lacson said viber messag report"
  },
  {
    "timestamp": "2025-08-16T19:32:51.095338",
    "text": "MANILA, Philippines — ACT Teachers party-list Rep. Antonio Tinio said the 2026 budget for the Department of Education (DepEd) is still “insufficient.”\n\nThe 2025 General Appropriations Act (GAA) gave DepEd a budget of P734.187 billion this year, while the 2026 National Expenditure Program (NEP) proposes P872.887 billion for the agency next year.\n\nThis meant a proposed 18.89-percent increase in the DepEd’s budget.\n\nDespite this, in a statement Saturday, Tinio’s office said: “The allocation remains insufficient to meet actual needs.”\n\nThe ACT Teachers party-list representative further flagged the number of classrooms the government was aiming to build in 2026.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.65,
    "user_comment": "",
    "link": null,
    "title": "Lawmaker says DepEd 2026 budget ‘still insufficient’ to meet targets",
    "summary": "ACT Teachers party-list Rep. Antonio Tinio stated the proposed 2026 Department of Education (DepEd) budget of P872. 887 billion is \"insufficient.",
    "factuality_score": 73,
    "processed_text": "manila philippin act teacher partylist rep antonio tinio said budget depart educ depe still insuffici gener appropri act gaa gave depe budget p billion year nation expenditur program nep propos p billion agenc next year meant propos percent increas depe budget despit statement saturday tinio offic said alloc remain insuffici meet actual need act teacher partylist repres flag number classroom govern aim build"
  },
  {
    "timestamp": "2025-08-16T20:52:27.847074",
    "text": "The national government, in partnership with the Council for the Welfare of Children (CWC), the European Union, and UNICEF, has launched a new budget tagging tool to help local government units (LGUs) track and prioritize spending for children’s welfare. The initiative, known as Child Budget and Expenditure Tagging and Training (CBETT), aims to institutionalize child-responsive budgeting across LGUs, ensuring that programs on nutrition, education, protection, and mental health are adequately funded and monitored. During its launch attended by local officials, Baguio City Mayor Benjamin Magalong underscored the urgency of aligning budgets with the actual needs of children, citing persistent gaps in poverty reduction and rising cases of school violence. “How do we address child poverty?",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.6000000000000001,
    "user_comment": "",
    "link": "https://www.abs-cbn.com/news/nation/2025/8/14/gov-t-launches-budget-tool-to-boost-lgu-support-for-child-welfare-2149",
    "title": "Gov’t launches budget tool to boost LGU support for child welfare",
    "summary": "The national government, in partnership with the Council for the Welfare of Children, European Union, and UNICEF, has launched a new budget tagging tool called Child Budget and Expenditure Tagging and Training (CBETT). This initiative aims to help local government units track and prioritize spending for children’s welfare. CBETT seeks to institutionalize child-responsive budgeting, ensuring adequate funding for programs on nutrition, education, protection, and mental health.",
    "factuality_score": 86,
    "processed_text": "nation govern partnership council welfar children cwc european union unicef launch new budget tag tool help local govern unit lgu track priorit spend children welfar initi known child budget expenditur tag train cbett aim institution childrespons budget across lgu ensur program nutrit educ protect mental health adequ fund monitor launch attend local offici baguio citi mayor benjamin magalong underscor urgenc align budget actual need children cite persist gap poverti reduct rise case school violenc address child poverti"
  },
  {
    "timestamp": "2025-08-18T23:33:08.977693",
    "text": "MANILA — Members of the Senate majority on Monday clashed with their counterparts in the minority over the membership in the bicameral Commission on Appointments—the body charged by the Constitution with approving or rejecting appointments made by the President of the Philippines. Under the Constitution, the CA consists of the Senate President as ex officio Chairman, 12 senators, and 12 members of the House of Representatives, elected by each House on the basis of proportional representation from the political parties and parties of organizations registered under the party-list system.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.7000000000000001,
    "user_comment": "",
    "link": "https://www.abs-cbn.com/news/nation/2025/8/18/senators-wrangle-over-membership-in-ca-1916",
    "title": "Senators wrangle over membership in CA",
    "summary": "The Senate majority and minority clashed over membership in the bicameral Commission on Appointments (CA). This constitutional body is responsible for approving or rejecting appointments made by the President. The CA comprises the Senate President, 12 senators, and 12 House members, elected proportionally by their respective chambers.",
    "factuality_score": 70,
    "processed_text": "manila member senat major monday clash counterpart minor membership bicamer commiss appointmentsth bodi charg constitut approv reject appoint made presid philippin constitut ca consist senat presid ex officio chairman senat member hous repres elect hous basi proport represent polit parti parti organ regist partylist system"
  },
  {
    "timestamp": "2025-08-20T03:57:07.665910",
    "text": "The zero balance billing policy in hospitals run by the Department of Health is “proceeding well” as President Ferdinand Marcos Jr. on Tuesday urged Filipinos to avail of the said benefit. He made the call during a visit to the East Avenue Medical Center as part of his ongoing inspection of the implementation of the zero balance billing scheme that he announced in his State of the Nation Address last month. “I’m happy to be able to report that the zero billing program is proceeding well. Siyempre sa umpisa, we have to do information drive, hindi lamang sa mga hospital kung hindi pati sa pasyente. And I think we are succeeding in that,” Marcos said.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.73,
    "user_comment": "",
    "link": "https://politiko.com.ph/2025/08/19/marcos-happy-to-report-zero-billing-in-doh-hospitals-is-proceeding-well/daily-feed/",
    "title": "Marcos: Happy to report zero billing in DOH hospitals is ‘proceeding well’",
    "summary": "President Ferdinand Marcos Jr. reported that the zero balance billing policy in Department of Health hospitals is \"proceeding well. \" He urged Filipinos to avail of this benefit during an inspection visit to the East Avenue Medical Center.",
    "factuality_score": 71,
    "processed_text": "zero balanc bill polici hospit run depart health proceed well presid ferdinand marco jr tuesday urg filipino avail said benefit made call visit east avenu medic center part ongo inspect implement zero balanc bill scheme announc state nation address last month im happi abl report zero bill program proceed well siyempr sa umpisa inform drive hindi lamang sa mga hospit kung hindi pati sa pasyent think succeed marco said"
  },
  {
    "timestamp": "2025-08-20T17:50:05.045930",
    "text": "MANILA, Philippines — One of the Top 15 contractors that bagged the bulk of the country’s flood control projects under the Marcos administration had a paid-up capital equivalent to only a small fraction of the billions of pesos in contracts it had won from the Philippine government. Established on March 7, 2019, MG Samidan Construction and Development Corp. had a paid-up capital of P250,000 based on records from the Securities and Exchange Commission. By 2025, it had become the 12th top contractor based on the value of contracts of flood control projects in the country. The majority of its 58 contracts is located in the Cordillera region and was worth a total of P5.02 billion from 2022 to 2025.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.67,
    "user_comment": "",
    "link": "https://newsinfo.inquirer.net/2096637/firm-with-p250000-capital-bags-p5-b-flood-control-deals",
    "title": "Firm with P250,000 capital bags P5-B flood control deals",
    "summary": "MG Samidan Construction and Development Corp. , established in 2019, became a top contractor for flood control projects under the Marcos administration. Despite having a paid-up capital of P250,000, it secured contracts worth P5.",
    "factuality_score": 53,
    "processed_text": "manila philippin one top contractor bag bulk countri flood control project marco administr paidup capit equival small fraction billion peso contract philippin govern establish march mg samidan construct develop corp paidup capit p base record secur exchang commiss becom th top contractor base valu contract flood control project countri major contract locat cordillera region worth total p billion"
  },
  {
    "timestamp": "2025-08-20T18:03:44.093708",
    "text": "This is a continuation of Rappler’s promise tracker of the Marcos Jr. administration. Check this out for the Marcos Year 2 promise tracker. MANILA, Philippines — President Ferdinand Marcos Jr. will deliver his fourth State of the Nation Address (SONA) on Monday, July 28. Halfway through his term, what has the Marcos Jr. administration done so far? Rappler’s community partners from the #FactsFirstPH, #AtinAngPilipinas, and #CourageON: No Lockdown on Rights coalitions identified updates on key promises made by Marcos and his administration during his third year in power.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.66,
    "user_comment": "",
    "link": "https://www.rappler.com/philippines/marcos-year-3-promises-progress-backlogs/",
    "title": "Marcos Year 3: Promises, progress, backlogs",
    "summary": "President Ferdinand Marcos Jr. is scheduled to deliver his fourth State of the Nation Address on Monday, July 28, marking the halfway point of his term. Rappler's promise tracker, in collaboration with community partners, assesses updates on key commitments made by his administration during its third year.",
    "factuality_score": 72,
    "processed_text": "continu rappler promis tracker marco jr administr check marco year promis tracker manila philippin presid ferdinand marco jr deliv fourth state nation address sona monday juli halfway term marco jr administr done far rappler commun partner factsfirstph atinangpilipina courageon lockdown right coalit identifi updat key promis made marco administr third year power"
  },
  {
    "timestamp": "2025-08-20T18:10:11.613930",
    "text": "MANILA — Nueva Ecija Governor Aurelio Umali on Tuesday said he has formally asked the Ombudsman to reverse its decision finding him guilty of conduct prejudicial to the best interest of service and simple misconduct over the issuance of quarry permits, which suspended him for a year without pay. “I have already filed a Motion for Reconsideration, which is now pending resolution. We will continue to go through the proper legal process because we firmly believe in truth and justice,” he added. “I will not back down. My focus remains on serving you and sustaining the programs that uplift the lives of Novo Ecijanos.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.65,
    "user_comment": "",
    "link": "https://www.abs-cbn.com/news/nation/2025/8/19/nueva-ecija-gov-appeals-ombudsman-suspension-over-quarry-permits-1205",
    "title": "Nueva Ecija gov appeals Ombudsman suspension over quarry permits",
    "summary": "Nueva Ecija Governor Aurelio Umali filed a Motion for Reconsideration with the Ombudsman regarding his one-year suspension without pay. He was found guilty of conduct prejudicial to the best interest of service and simple misconduct over quarry permit issuances. Umali asserts his belief in truth and justice, stating his focus remains on serving his constituents.",
    "factuality_score": 75,
    "processed_text": "manila nueva ecija governor aurelio umali tuesday said formal ask ombudsman revers decis find guilti conduct prejudici best interest servic simpl misconduct issuanc quarri permit suspend year without pay alreadi file motion reconsider pend resolut continu go proper legal process firmli believ truth justic ad back focu remain serv sustain program uplift live novo ecijano"
  },
  {
    "timestamp": "2025-08-28T15:31:08.384086",
    "text": "MANILA, Philippines — President Ferdinand Marcos Jr. has ordered a lifestyle check on all government officials—starting with those in the Department of Public Works and Highways (DPWH)—as part of a widening scrutiny of flood-control projects, Palace press officer Claire Castro said on Wednesday. Castro said the president’s directive covers the entire executive department, beginning with the DPWH, the agency implementing and overseeing the multibillion-peso projects he wanted investigated for alleged irregularities. “We cannot deny the fact that there are DPWH officials who are involved, and we should start the lifestyle checks with them,” she said in a media briefing.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.74,
    "user_comment": "",
    "link": "https://newsinfo.inquirer.net/2101279/marcos-orders-lifestyle-checks-starts-with-dpwh",
    "title": "Marcos orders lifestyle checks, starts with DPWH",
    "summary": "President Ferdinand Marcos Jr. has ordered a lifestyle check on all government officials, beginning with the Department of Public Works and Highways (DPWH). This directive is part of a wider scrutiny into alleged irregularities within multibillion-peso flood-control projects.",
    "factuality_score": 71,
    "processed_text": "manila philippin presid ferdinand marco jr order lifestyl check govern officialsstart depart public work highway dpwha part widen scrutini floodcontrol project palac press offic clair castro said wednesday castro said presid direct cover entir execut depart begin dpwh agenc implement overse multibillionpeso project want investig alleg irregular cannot deni fact dpwh offici involv start lifestyl check said media brief"
  },
  {
    "timestamp": "2025-08-28T16:54:36.806767",
    "text": "Photo from Wendell Alinea/Senate Social Media Unit\n\nThe Philippine Contractors Accreditation Board (PCAB), an attached agency of the Department of Trade and Industry (DTI), has allegedly been demanding at least P2 million in exchange for accreditation of private contractors handling government projects, Senator Panfilo Lacson said. During the interpellation of Senate Minority Leader Vicente Sotto III Wednesday (August 27), Lacson said his office has been receiving reports that corruption has seeped even into the accreditation process for flood control projects. “It seems na medyo nahaluan na rin ‘ata ng konting… o hindi lang konti, na ng katiwalian pagdating sa mga flood control projects.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.64,
    "user_comment": "",
    "link": "https://politiko.com.ph/2025/08/27/accreditation-for-sale-ping-lacson-exposes-pcabs-p2-m-racket/daily-feed/",
    "title": "Accreditation for sale: Ping Lacson exposes PCAB’s P2-M racket",
    "summary": "Senator Panfilo Lacson alleged the Philippine Contractors Accreditation Board (PCAB) demands at least P2 million for accreditation of private contractors on government projects. Lacson's office has received reports that this alleged corruption specifically impacts flood control projects.",
    "factuality_score": 55,
    "processed_text": "photo wendel alineasen social media unit philippin contractor accredit board pcab attach agenc depart trade industri dti allegedli demand least p million exchang accredit privat contractor handl govern project senat panfilo lacson said interpel senat minor leader vicent sotto iii wednesday august lacson said offic receiv report corrupt seep even accredit process flood control project seem na medyo nahaluan na rin ata ng kont hindi lang konti na ng katiwalian pagdat sa mga flood control project"
  },
  {
    "timestamp": "2025-08-28T21:14:37.939401",
    "text": "“We are greatly appreciative of all the support that the United States has given us in the face of all the challenges that we in the Philippines are facing and the continuing support that you have given us with regard to the modernization of our armed forces, as part of our response to those challenges that we are facing,” he said. “And that's something that we, of course, would like to do together, but not only bilateral between the US and the Philippines, but also with our multilateral arrangements that we have made around the region, and even in far-away areas,” the president stated.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.61,
    "user_comment": "",
    "link": "https://www.abs-cbn.com/news/nation/2025/8/28/marcos-jr-meets-us-senators-thanks-washington-for-armed-forces-modernization-support-2034",
    "title": "Marcos Jr. meets US senators, thanks Washington for Armed Forces modernization support",
    "summary": "The Philippines expressed gratitude for the United States' support in facing its challenges and modernizing its armed forces. It seeks to continue this cooperation not only bilaterally, but also through multilateral arrangements within the region and beyond.",
    "factuality_score": 77,
    "processed_text": "greatli appreci support unit state given us face challeng philippin face continu support given us regard modern arm forc part respons challeng face said that someth cours would like togeth bilater us philippin also multilater arrang made around region even faraway area presid state"
  },
  {
    "timestamp": "2025-08-29T01:37:02.760092",
    "text": "MANILA, Philippines – An ethics complaint was filed on Thursday, August 28, against Deputy Minority Leader Risa Hontiveros over alleged witness tampering in relation to her panel’s investigation into alleged human rights abuses of doomsday preacher Apollo Quiboloy. Lawyers Ferdinand Topacio, Manuelito Luna, and Jacinto Paras filed the complaint. They claimed that Hontiveros bribed the witness, Michael Maurilio, to lie under oath and implicate Quiboloy, former president Rodrigo Duterte and his daughter, Vice President Sara Duterte. “We respectfully allege that the above actions of Senator Hontiveros-Baraquel constitute ‘disorderly behavior,’ a subject proper for investigation by the Senate pursuant to Article VI, Section 16(3) of the 1987 Constitution,” the complaint said. The senator categoricalld denied Maurilio’s allegations.",
    "predicted_label": "Fake",
    "actual_label": "Fake",
    "confidence": 0.61,
    "user_comment": "",
    "link": "https://www.rappler.com/philippines/ethics-complaint-filed-vs-hontiveros-over-alleged-witness-tampering/",
    "title": "‘Recycled lies’: Hontiveros slams ethics rap over alleged witness tampering",
    "summary": "An ethics complaint was filed on Thursday, August 28, against Deputy Minority Leader Risa Hontiveros. The complaint, filed by lawyers Ferdinand Topacio, Manuelito Luna, and Jacinto Paras, alleges witness tampering in her panel's investigation into Apollo Quiboloy. It claims Hontiveros bribed witness Michael Maurilio to implicate Quiboloy, former president Rodrigo Duterte, and Vice President Sara Duterte, allegations the senator categorically denied.",
    "factuality_score": 44,
    "processed_text": "manila philippin ethic complaint file thursday august deputi minor leader risa hontivero alleg wit tamper relat panel investig alleg human right abus doomsday preacher apollo quiboloy lawyer ferdinand topacio manuelito luna jacinto para file complaint claim hontivero bribe wit michael maurilio lie oath implic quiboloy former presid rodrigo dutert daughter vice presid sara dutert respect alleg action senat hontiverosbaraquel constitut disorderli behavior subject proper investig senat pursuant articl vi section constitut complaint said senat categoricalld deni maurilio alleg"
  },
  {
    "timestamp": "2025-08-29T03:16:21.903261",
    "text": "Happy together! Former President Rodrigo Duterte was overjoyed when all of his four children visited him at the International Criminal Court (ICC) detention in The Hague. Vice President Sara Duterte came with her siblings Davao Rep. Pulong, acting Mayor Baste, and youngest sister Kitty for their first-ever complete squad visit since their dad’s detention in March. According to Vice President Sara Duterte, her father was very happy during the noisy yet heartwarming family reunion at the ICC facility. “Masaya siya. He’s been informed of it since Friday of last week. Nung tatlo na kami ang bumisita at sinabihan na siya na nag-aantay na lang ng isa, and Wednesday this week, meron kaming approved visit na kaming apat.",
    "predicted_label": "Fake",
    "actual_label": "Fake",
    "confidence": 0.59,
    "user_comment": "",
    "link": "https://politiko.com.ph/2025/08/28/sabay-sabay-nagsasalita-lahat-rody-duterte-happy-to-reunite-with-sara-pulong-baste-kitty-in-the-hague/headlines/",
    "title": "‘Sabay-sabay nagsasalita lahat!’ Rody Duterte happy to reunite with Sara, Pulong, Baste, Kitty in The Hague",
    "summary": "Former President Rodrigo Duterte received a visit from all four of his children, including Vice President Sara Duterte, at the International Criminal Court (ICC) detention in The Hague. This marked their first complete family visit since his detention began in March. According to Vice President Sara Duterte, her father was very happy during the family reunion.",
    "factuality_score": 37,
    "processed_text": "happi togeth former presid rodrigo dutert overjoy four children visit intern crimin court icc detent hagu vice presid sara dutert came sibl davao rep pulong act mayor bast youngest sister kitti firstev complet squad visit sinc dad detent march accord vice presid sara dutert father happi noisi yet heartwarm famili reunion icc facil masaya siya he inform sinc friday last week nung tatlo na kami ang bumisita sinabihan na siya na nagaantay na lang ng isa wednesday week meron kame approv visit na kame apat"
  },
  {
    "timestamp": "2025-09-10T01:30:00.244165",
    "text": "MANILA, Philippines — Contractor-spouses Pacifico “Curlee” and Cezarah “Sarah” Discaya have offered to turn state witnesses after they dropped a bombshell on Monday by naming several congressmen and officials of the Department of Public Works and Highways (DPWH) who allegedly demanded kickbacks of up to 25 percent after their firms won government-funded flood control projects. Lawmakers, led by Speaker Martin Romualdez, have denied the allegations, which they said are false and malicious. This developed as President Ferdinand Marcos Jr. on Monday said there will be no funding allocation for flood control projects in the proposed 2026 national budget.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.62,
    "user_comment": "",
    "link": "https://newsinfo.inquirer.net/2106503/discayas-name-solons-in-flood-control-mess",
    "title": "Discayas name solons in flood control mess",
    "summary": "Contractor-spouses alleged that congressmen and DPWH officials demanded up to 25% kickbacks for government flood control projects. The spouses offered to turn state witnesses, while lawmakers, including Speaker Martin Romualdez, denied the \"false and malicious\" accusations. President Ferdinand Marcos Jr.",
    "factuality_score": 76,
    "processed_text": "manila philippin contractorspous pacifico curle cezarah sarah discaya offer turn state wit drop bombshel monday name sever congressmen offici depart public work highway dpwh allegedli demand kickback percent firm governmentfund flood control project lawmak led speaker martin romualdez deni alleg said fals malici develop presid ferdinand marco jr monday said fund alloc flood control project propos nation budget"
  },
  {
    "timestamp": "2025-09-15T19:55:22.201641",
    "text": "President Ferdinand Marcos Jr. appointed former Public Works Secretary Rogelio “Babes” Singson, recognized for his anticorruption efforts and good governance, and SGV & Co. country managing partner Rossana Fajardo, a certified fraud examiner, to the fact-finding body that would investigate anomalous flood control and other infrastructure projects. The chair and third member of the Independent Commission on Infrastructure (ICI) would be named “in the coming days,” according to Malacañang press officer Claire Castro, who announced the appointments of Singson and Fajardo on Saturday. Mr. Marcos created the ICI through an executive order (EO) on Sept. 11. Baguio City Mayor Benjamin Magalong, a former national police official, was designated as the commission’s special adviser and investigator.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.86,
    "user_comment": "",
    "link": "https://newsinfo.inquirer.net/2108807/singson-fajardo-named-to-independent-probe-body",
    "title": "Singson, Fajardo named to independent probe body",
    "summary": "President Ferdinand Marcos Jr. appointed Rogelio Singson and Rossana Fajardo to the Independent Commission on Infrastructure (ICI). Created by executive order on September 11, the ICI will investigate anomalous flood control and other infrastructure projects.",
    "factuality_score": 65,
    "processed_text": "presid ferdinand marco jr appoint former public work secretari rogelio babe singson recogn anticorrupt effort good govern sgv co countri manag partner rossana fajardo certifi fraud examin factfind bodi would investig anomal flood control infrastructur project chair third member independ commiss infrastructur ici would name come day accord malacaang press offic clair castro announc appoint singson fajardo saturday mr marco creat ici execut order eo sept baguio citi mayor benjamin magalong former nation polic offici design commiss special advis investig"
  },
  {
    "timestamp": "2025-09-17T01:26:12.642104",
    "text": "MANILA, Philippines—President Ferdinand Marcos Jr. on Monday named Andres Reyes Jr., a retired associate justice appointed to the Supreme Court by his predecessor, Rodrigo Duterte, to head the three-member Independent Commission for Infrastructure (ICI) that will investigate corruption in government infrastructure projects. Reyes will be working with Rogelio Singson, the secretary of the Department of Public Works and Highways (DPWH) during the term of the late former President Benigno “Noynoy” Aquino III, and Rossana Fajardo, country managing partner of auditing firm SGV & Co.\n\nBaguio City Mayor Benjamin Magalong, who is not resigning from his local government post, will serve as the ICI’s special adviser and investigator.",
    "predicted_label": "Real",
    "actual_label": "Real",
    "confidence": 0.6000000000000001,
    "user_comment": "",
    "link": "https://newsinfo.inquirer.net/2109617/ex-sc-justice-leads-body-probing-govt-infra-mess",
    "title": "Ex-SC justice leads body probing gov’t infra mess",
    "summary": "President Ferdinand Marcos Jr. appointed retired justice Andres Reyes Jr. to lead the Independent Commission for Infrastructure (ICI).",
    "factuality_score": 75,
    "processed_text": "manila philippinespresid ferdinand marco jr monday name andr rey jr retir associ justic appoint suprem court predecessor rodrigo dutert head threememb independ commiss infrastructur ici investig corrupt govern infrastructur project rey work rogelio singson secretari depart public work highway dpwh term late former presid benigno noynoy aquino iii rossana fajardo countri manag partner audit firm sgv co baguio citi mayor benjamin magalong resign local govern post serv ici special advis investig"
  }
]